Q1. List any five functions of the pandas library with execution.

Ans.Here are five common functions from the Pandas library along with their execution:

(a).'read_csv()': THis function is used to read CSV file into a DataFrame:

In [1]:
import pandas as pd

In [1]:
import pandas as pd
# we a CSV file named 'services.csv'
df = pd.read_csv('services.csv')

(b).'head()': This function is used to display the first n rows of DataFrame.

In [21]:
# Assuming 'df' as DataFrame
df.head(3)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN

(c).'info'(): This function provides a concise summary of a DataFrame ,including the Data types and non-null values.

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 22 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       23 non-null     int64
 1   location_id              23 non-null     int64
 2   program_id               0 non-null      float64
 3   accepted_payments        1 non-null      object
 4   alternate_name           1 non-null      object
 5   application_process      23 non-null     object
 6   audience                 14 non-null     object
 7   description              23 non-null     object
 8   eligibility              21 non-null     object
 9   email                    1 non-null      object
 10  fees                     21 non-null     object
 11  funding_sources          21 non-null     object
 12  interpretation_services  1 non-null      object
 13  keywords                 21 non-null     object
 14  languages                1 non-null      object
 15  name                     23 non-null     object
 16  required_documents       1 non-null      object
 17  service_areas            21 non-null     object
 18  status                   23 non-null     object
 19  wait_time                19 non-null     object
 20  website                  2 non-null      object
 21  taxonomy_ids             1 non-null      object
dtypes: float64(1), int64(2), object(19)
memory usage: 4.1+ KB

(d).'describe()': This function generates descriptive statistics of a DataFrame ,including measures like 'mean','min','max',etc.

In [23]:
df.describe()
#this will print the summary statistics of the DataFrame

             id  location_id  program_id
count  23.00000    23.000000         0.0
mean   12.00000    11.956522         NaN
std     6.78233     6.711444         NaN
min     1.00000     1.000000         NaN
25%     6.50000     6.500000         NaN
50%    12.00000    12.000000         NaN
75%    17.50000    17.500000         NaN
max    23.00000    22.000000         NaN

(e).'groupby()': This function is used to group data based on some criteria and then apply a function to each group independentaly .

In [31]:
df2=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [33]:
df2.groupby("Fare")

In [34]:
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

here df2 has cloumn nmaed 'Fare' and we want to calculate for each fare

these are just a few examples of the many functions available in the Pandas library .they are incredible useful for data manipulation and analysis tasks in Python.

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [12]:
df3  = {"A":[1,2,3,4],
      "B":[2,3,34,54],
      "C":[3,4,55,6]}

In [13]:
df = pd.DataFrame(df3)

In [14]:
df

   A   B   C
0  1   2   3
1  2   3   4
2  3  34  55
3  4  54   6

In [17]:
df = pd.DataFrame(df3, index = [1,3,5,7])

In [18]:
df

   A   B   C
1  1   2   3
3  2   3   4
5  3  34  55
7  4  54   6

In [1]:
import pandas as pd

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [22]:
data1 = {"Values":[22,33,44,55,66,],
      "A":["Moto","Realme","Apple","Samsung","OnePlus"],
      "B":["Python","Numpy","Pandas","Stattics","MachineL"]}
df4 = pd.DataFrame(data1)

In [23]:
df4

   Values        A         B
0      22     Moto    Python
1      33   Realme     Numpy
2      44    Apple    Pandas
3      55  Samsung  Stattics
4      66  OnePlus  MachineL

In [28]:
def test(x):
    return x.sum()
df4.apply(test)

Values                                  220
A             MotoRealmeAppleSamsungOnePlus
B         PythonNumpyPandasStatticsMachineL
dtype: object

In [29]:
df4["Values"]

0    22
1    33
2    44
3    55
4    66
Name: Values, dtype: int64

In [31]:
df4["Values"][0:3]

0    22
1    33
2    44
Name: Values, dtype: int64

from functools import reduce

In [34]:
reduce(lambda x,y:x+y,df4["Values"][0:3])

99

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [49]:
pd.set_option("display.max_colwidth", 1000)
df5 = pd.DataFrame({"Text":["Given the enormous volumes of data being produced today, data science is a crucial component of many sectors and is one of the most hotly contested topics in IT. Since data science has become more and more popular, businesses have begun to use it to expand their operations and improve consumer happiness. Learn about data science and how to become a data scientist in this post.The field of study known as data science works with enormous amounts of data using cutting-edge tools and methods to uncover hidden patterns, glean valuable information, and make business decisions. Data science creates predictive models using sophisticated machine learning algorithms. The information used for analysis might originate from numerous sources and be presented in a variety of formates","My name is Pranay Krishna","I am learning Datascience in PW Skills"]})

In [50]:
df5

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          Text
0  Given the enormous volumes of data being produced today, data science is a crucial component of many sectors and is one of the most hotly contested topics in IT. Since data science has become more and more popular, businesses have begun to use it to expand their operations and improve consumer happiness. Learn about data science and how to become a data scientist in this post.The field of study known as data science works with enormous amounts of data using cutting-edge tools and methods to uncover hidden patterns, glean valuable information, and make business decisions. Data science creates predictive models using sophisticated machine learning algorithms. The information used for analysis might originate from numerous sources and be presented in a variety of formates
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    My name is Pranay Krishna
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       I am learning Datascience in PW Skills

In [55]:
df5["Word_count"] = df5["Text"].apply(lambda x:len(x.split()))

In [56]:
df5

,Text,Word_count,len
0,"Given the enormous volumes of data being produced today, data science is a crucial component of many sectors and is one of the most hotly contested topics in IT. Since data science has become more and more popular, businesses have begun to use it to expand their operations and improve consumer happiness. Learn about data science and how to become a data scientist in this post.The field of study known as data science works with enormous amounts of data using cutting-edge tools and methods to uncover hidden patterns, glean valuable information, and make business decisions. Data science creates predictive models using sophisticated machine learning algorithms. The information used for analysis might originate from numerous sources and be presented in a variety of formates",123,779
1,My name is Pranay Krishna,5,25
2,I am learning Datascience in PW Skills,7,38

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans."DataFrame.size()" and "DataFrame.shape()"are both methods used in Pandas library for handling data in Python ,but they serve different purposes:

(a)."DataFrame.size()":This method return the total number of elements in the DataFrame .it calculates this by multiplying the no of rows by the no of columns .In other words ,it gives us the total count of cells in the DataFrame.

(b)."DataFrame.shape()":This method returns the tuple representing the dimention of the DataFrame .it provides the number of rows followed by the number of columns .for example ,if a DataFrame has 5 rows and 3 columns ,'DataFrame.shape()' would (5,3).

In summary ,DataFrame.size() gives us the total numberm of elements (cells)in Dataframe ,while "DataFrame.shape()" provides the number of rows and columns in the "Dataframe".

Q6. Which function of pandas do we use to read an excel file?

Ans. We use the function that is used to read excel file in Pandas.

In [ ]:
# let's assume we have an excel file named example.xlsx
pd.read_excel("example.xlsx")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [39]:
df = pd.DataFrame({"Email":["tanaykumar@gmail.com","chrish.john@gmail.com","kumar.shangkara@gmail.com","virat.kohli@gmail.com","krish.ivan@gmail.com"]})

In [40]:
df

                       Email
0       tanaykumar@gmail.com
1      chrish.john@gmail.com
2  kumar.shangkara@gmail.com
3      virat.kohli@gmail.com
4       krish.ivan@gmail.com

In [42]:
df["Username"] = df["Email"].apply(lambda x:x.split('@')[0])

In [43]:
df

                       Email         Username
0       tanaykumar@gmail.com       tanaykumar
1      chrish.john@gmail.com      chrish.john
2  kumar.shangkara@gmail.com  kumar.shangkara
3      virat.kohli@gmail.com      virat.kohli
4       krish.ivan@gmail.com       krish.ivan

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values

 A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

Your function should select the following rows:   A   B   C

1  8   2   7

4  9   1   2

The function should return a new DataFrame that contains only the selected rows.

In [3]:
data= pd.DataFrame({"A":[3,8,6,2,9],
                   "B":[5,2,9,3,1],
                    "C":[1,7,4,5,2]
                   })

In [4]:
data

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [7]:
data[["A","B","C"]][1:5:3]

   A  B  C
1  8  2  7
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [11]:
df = pd.DataFrame({"Values":[10,12,13,9,15,13]})

In [12]:
df

   Values
0      10
1      12
2      13
3       9
4      15
5      13

In [14]:
df["Values"].mean()

12.0

In [15]:
df["Values"].median()

12.5

In [16]:
df["Values"].std()

2.1908902300206643

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [55]:
record = pd.DataFrame({"Sales":[13,14,10,9,11,20,16,10],
                      "date":date})

In [56]:
record

   Sales       date
0     13 2023-07-10
1     14 2023-07-11
2     10 2023-07-12
3      9 2023-07-13
4     11 2023-07-14
5     20 2023-07-15
6     16 2023-07-16
7     10 2023-07-17

In [53]:
date = pd.date_range(start='2023-07-10' ,end = '2023-7-17')

In [54]:
date

DatetimeIndex(['2023-07-10', '2023-07-11', '2023-07-12', '2023-07-13',
               '2023-07-14', '2023-07-15', '2023-07-16', '2023-07-17'],
              dtype='datetime64[ns]', freq='D')

In [57]:
record["MovingAverage"] = record["Sales"].rolling(window=7).mean()

In [58]:
record

   Sales       date  MovingAverage
0     13 2023-07-10            NaN
1     14 2023-07-11            NaN
2     10 2023-07-12            NaN
3      9 2023-07-13            NaN
4     11 2023-07-14            NaN
5     20 2023-07-15            NaN
6     16 2023-07-16      13.285714
7     10 2023-07-17      12.857143

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

 Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

Your function should create the following DataFrame:


         Date    Weekday

0  2023-01-01    Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday

The function should return the modified DataFrame

In [62]:
date = pd.date_range(start='2023-01-01' ,end = '2023-01-05')

In [63]:
df =pd.DataFrame(date)

In [64]:
df = df.rename(columns={0: 'Date'})

In [65]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [67]:
df["DayNumber"] =df["Date"].dt.dayofweek

In [68]:
df

        Date  DayNumber
0 2023-01-01          6
1 2023-01-02          0
2 2023-01-03          1
3 2023-01-04          2
4 2023-01-05          3

In [73]:
weekday = ["Sunday","Monday","Tuesday","Wednesday","Thursday","Friday","Saterday"]

In [74]:
df["Weekday"] =df["DayNumber"].apply(lambda x:weekday[x])

In [75]:
df

        Date  DayNumber    Weekday
0 2023-01-01          6   Saterday
1 2023-01-02          0     Sunday
2 2023-01-03          1     Monday
3 2023-01-04          2    Tuesday
4 2023-01-05          3  Wednesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [76]:
date = pd.date_range(start='2023-01-01' ,end = '2023-01-31')

In [79]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

In [80]:
df = pd.DataFrame({'Date':date})

In [82]:
df['Timestamps'] = pd.to_datetime(df['Date'])

In [83]:
df

         Date Timestamps
0  2023-01-01 2023-01-01
1  2023-01-02 2023-01-02
2  2023-01-03 2023-01-03
3  2023-01-04 2023-01-04
4  2023-01-05 2023-01-05
5  2023-01-06 2023-01-06
6  2023-01-07 2023-01-07
7  2023-01-08 2023-01-08
8  2023-01-09 2023-01-09
9  2023-01-10 2023-01-10
10 2023-01-11 2023-01-11
11 2023-01-12 2023-01-12
12 2023-01-13 2023-01-13
13 2023-01-14 2023-01-14
14 2023-01-15 2023-01-15
15 2023-01-16 2023-01-16
16 2023-01-17 2023-01-17
17 2023-01-18 2023-01-18
18 2023-01-19 2023-01-19
19 2023-01-20 2023-01-20
20 2023-01-21 2023-01-21
21 2023-01-22 2023-01-22
22 2023-01-23 2023-01-23
23 2023-01-24 2023-01-24
24 2023-01-25 2023-01-25
25 2023-01-26 2023-01-26
26 2023-01-27 2023-01-27
27 2023-01-28 2023-01-28
28 2023-01-29 2023-01-29
29 2023-01-30 2023-01-30
30 2023-01-31 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Ans.The first and foremost library we need to import to use the basic functions of Pandas is 'Pandas' itself .We can do this with the following line of code in Pythobn.

In [84]:
import pandas as pd